delete
from change
where task_id = 52;

insert into change (author_id, change_time, field, new_value, old_value, task_id)
VALUES (2, '2023-04-28 10:20:00', 'NONE', '', '', 52),
       (2, '2023-04-28 10:21:00', 'USER', 'Иванов Иван Иванович', 'Не назначено', 52),
       (2, '2023-04-28 10:21:01', 'STATUS', 'OPENED', '', 52),
       (2, '2023-04-28 10:22:00', 'STATUS', 'WORKING', 'OPENED', 52),
       (2, '2023-05-07 10:23:00', 'STATUS', 'TESTING', 'WORKING', 52),
       (2, '2023-05-07 10:23:10', 'STATUS', 'CLOSED', 'TESTING', 52);

delete
from message
where task_id = 52;
insert into message (author_id, local_date_time, task_id, text)
VALUES (34, '2023-05-06 10:23:10', 52, 'Проверил сайт. С точки зрения архитектуры замечаний нет'),
       (33, '2023-05-06 12:23:10', 52, 'Дизайн не нарушен'),
       (32, '2023-05-06 13:14:10', 52, 'Проверил фронтовую часть - без замечаний'),
       (31, '2023-05-06 18:14:10', 52, 'Без замечаний'),
       (28, '2023-05-06 22:14:10', 52,
        'Прогнал все автотесты - замечаний нет. Так же вручную проверял весь функционал - проблем не выявил'),
       (1, '2023-05-07 10:00:10', 52, 'Все работает'),
       (2, '2023-05-07 11:00:10', 52, 'Все проверил. От заказчика так же пришел положительный отзыв. Открываем сайт')
;
